738845194850773558
3738968195649774859
4738849194894773882
7739004195693774975
-7261194805221226386
-3689337711138901728
-2689200710357900655
-1689319711084901730
1757481363245650831
2757362362486649844
1195896392220930869
4195795391451929480
3195914392210930723
6195781391249929126
-7128402373671658935
-8690124345701380826
7756633728210171144
4756734728979172533
3756597728166171300
-3247029476127723832
-1247043476329724186
-129145008166137909
1870872991887862017
-4129149007954137465
-1129282008947139174
-7129272008741138808
-8129153007982137565
3313675859625516103
4313812860434517324
-8132909213241034354
8313816860478517392
-8932546057542867495
-6932528057568867609
-5932391056759866388
8570540777066461619
-429636223750539488
1127459907694805235
127578908485806392
5127719909274807567
-5872443091340192918
-1315223959315847746
-315342960042848847
-3315241959305847628
-4315378960086848699
9131224113041702374
-1865182682318401776
-5307971550110056052
-2307848549279054583
5695691654483839948
5252993787219186549
3253007787485187171
-9193714286190364511
-3747151213341814246
810067918938531886
-2190087081896469323
-9190214082467470004
7327336430450495350
-9119389643029055864
-4115748438709160582
-1115593437686158905
3884291561362839346
-6655927395515165363
-8655945395761165989
-3655804394968164826
-212983527176510806
787153473600490253
2787171473654490487
3787020472867489510
2904932941037075699
3905069941818076706
5905055941872077172
-5095107059002924325
-6094988058243923104
7347858809625731174
5347872809635730844
2347973810368732059
4465753277789317273
1462130073299421617
-2537905926744578235
7473164687826110412
-4530635517516786435
-3530498516767785588
-1412463047763197934
3587421951489801185
2587540952280802350
-8412622048338198339
8030347819806455716
9030484820615456959
8476641588870267502
7476760589625268543
-2523521411748733187
1033816721290613934
-3966324279534387421
-4966205278807386328
-1966338279544387275
-2966187278753386350
-8966465280115387956
2919541457568923211
1919404456791921936
-5091735158287767326
-9091771158315767194
-8091634157538766119
-641296879189318453
1358721120864681533
2358602120077680332
7358743120658680867
8794289579418543667
-3652432494449008463
-205887421398457440
794249579378543643
4351331710881888756
-766570757389698163
233310241887300764
1233447242664302071
6233332241905300962
-4209647626717354471
7237193447717198432
-8209651626505353779
1790630374868647951
8697050490955193511
4697014490911193675
3696877490134192400
-2749566582179357212
-7306785714459703344
-6306904715218704629
-1306763714361703082
-306626713584702071
4689502080141399321
-8314147124186495753
7128941744969160079
6128804744224159220
9128959745023160305
-5871239255891841056
6571758612764814199
3571603611933812906
-2874840460379736898
-7432059592404082070
-2432174593375084007
-3432055592616082778
-989115724037427557
10765275175571242
3010920276006572535
5010906275996572633
6010787275257571576
7010924276002572467
-7506384235581390893
-8506521236582392808
6940355838132160535
1936426631796262053
2936563632577263124
4797226510592237555
6797468512182240005
-202658488388760612
-2645598356987416013
-3645735357732416904
3804601920633030746
4804738921410031805
1804583920579030544
2804720921356031819
7804861921957032342
8804742921198031305
5804619920623030604
1361918053618377737
-4638359948015624821
-5638240947256623536
9122390911750307690
-6324454162664245193
-4324468162930245863
-2324450162924245773
1679310042378651050
-7767289030705899707
-1763510825413002970
6236529174658997246
7236666175467998449
-6206436693745657677
3487209931552756601
-512794068235242963
-8955755936847898358
-1396906697095000000
9046073171251654509
-400525901828896492
-1282613433387309359
-6282754433984310142
1160326435131345730
-839691564858654120
5160330435175345822
-6839713564940654454
-5839832565699655443
3035038556984966446
2034901556203965439
-7965124443634034243
-8965261444411035302
7477964425265621109
-6968743648143929951
-3522198575349379632
-1957590033086240723
-2957727033863241782
42427966967759255
2042413966701758841
4042431966963759443
3042294965962757528
-4408042312386689938
8038679761480862184
6038661761506862294
-5533197189576067599
6913268882499481459
4913250882493481369
-5090531322583414664
703579324144045970
-1296438675909954008
-296557676636955101
-3296456675883953898
-8292841471210057658
-5292942471963059053
9146509192468700917
-6300335881941851794
-7300216881186850753
-8300353881995851996
-8175048003539471998
-4175044003751472418
-3174907002942471215
-6175062003741472300
2271656070098079690
4828857202132424980
3828720201351423909
-3171150797683574404
3710958733904838649
-289045265883160915
-8735763339754712849
-4539885023607921459
-6539903023853922085
7460414977820080497
-3982701891595575995
-982546890824575042
-4628321180307498093
5818382893362053755
7814644688097156830
3257681557352812938
1257663557362813056
8257566556637812025
-6746100647744083283
813840053768678454
-4186044945552320533
8256920922884334326
-9189942151584218583
7256815922327333383
-9071279048844153004
-7071261048854153122
-6071124048045151919
4931893522763265934
-3068146477308733962
-2068265478067735255
-634630012192348800
-8520632749868659783
6926244324609892988
4926226324555892746
5926107323796891757
-1520473749037658594
4483304456267238355
6483290456065237989
-8963554618409314978
-7402734281641073196
-8402615280886071963
-5078457515830483462
-6078338515107482389
-1078453515786483402
-7521397384381138775
4925324689486413355
4482402820945758152
6482420820999758130
7482525821744759509
-3517637179126242000
4039480952417102913
1039581953154104132
3060490612540832338
-3382453256049823037
8064131816828727404
7621209948544072707
6621328949299074002
-7501152358833888406
3502510845760007338
5502528845814007324
-2944189228057544610
-940415022552647187
9059610977317352399
1616786109481698063
-383231890572301883
616649108700697054
-6826175758878956514
3620560314982595526
2620423314205594477
4817185265171864610
6820927470420761553
-7625780603244790259
-625653602673789324
1833966078556927530
2834103079369928763
6834107079157928311
-8612737995048623998
1509707312768337838
-490310687477662812
-2051131023989903826
-1050994023208902753
3395688050394648705
7394822415369169180
-51758657721381745
-608973789957727561
-9176307901497282391
-4176422902180283138
1840534911833780111
-159483088220219835
-7602563957335875707
6844176116329675849
-1716547219669564708
-3716565219723564694
-7601662322270396050
-4277504556958806803
-2277518557160807369
5284225414690914020
-7276757922692328501
-6276620921915327444
-8276638921905327302
-5276739922638328515
5727179283235569021
1126193382942482810
5126229382986482646
4126348383745483901
-8320373689946067773
-8877588822182413621
-6759553353177825959
-2316595484593170922
-2198834017210585710
-9202493221760481170
-7202475221706481200
4244109851160069017
5244246852161070930
-2317497119690650259
682625880884350440
-6317533119990651087
-4317515119936650885
1125547749381005553
6125464748666004102
-760432988437306018
1239585011552693824
4686386086139247217
-867255783834664811
1132762216411335839
-7867382784409665450
6136403420715230873
4136385420677230855
-7986077887193730895
-985918886318729368
-2428977755640385826
-1542232383501596031
2457803616542404093
-5985158251850250708
-7985176251840250566
6018641953300645757
-7303588876741005401
-303429875914004210
-2299947672181109599
-6093784317638569039
6906396683286432414
2024918785185496622
-974948214077502397
8467862653556151381
7467981654311152612
467854653740151741
-5535923551616745326
464098448481254928
-92860682507089288
3349960185284564716
4350097186097565949
7792886053889220161
8793023054666221242
-7653703019053330516
-5653685018999330538
-4653836020042332281
1149442028819396978
-4854080174949497665
-3854199175676498768
8359524589555835842
5359369588772834743
8802446458100491067
-6962046606718337437
-4200589112729926854
-5200726113506927935
7259175568841790177
3812630496047239920
2812493495238238719
1255429363788893814
-2744606636255106278
-1744725637042107477
-744588636265106420
8255556364363894453
-9191306710136658354
4373313832006480501
1373190831171479026
8816271700543135410
-5630468373378416690
2816249700493135244
8690965822342756180
-5755742251322795648
-7755760251312795490
-309179178474245125
-5312820382794140407
-4312939383521141502
-3312802382740140173
6133764690084410026
3698337232083548513
4248039953806100751
5247920953015099584
3247902953025099742
248035954018101491
-2752119047024900440
-3751354412512421448
-8754995617056317074
-6754977617002317104
-7270992690764838239
-3270956690720838371
-2270819689943837066
5732944515355059947
-7713914559325493608
8732843514650058678
-3713654557729491068
-3710154354006596575
-5595879090352905906
-4595742089571904833
-3595861090298905936
2415173524227782861
4415415525561784599
-584725475039215926
3972493657017129406
-8470472211415525463
-2470450211317525201
-4470468211371525147
-5378699121209676383
-7382441326522573326
-260764653006089998
-5260649651987088163
2872176636559084285
-578156641762363345
-7578315642593364536
-1510321897564962820
-4510220896859961775
-7956765969654512096
8932881972353694103
7932776971796693414
6932639971019692365
-5513826101327857645
-8071059233618203439
-71019233546203287
2615243982215418774
4615229981949418360
-2384929018605582143
-6388689223924479176
-8388675223914479274
-3388534223137478077
5607854572232625967
-6395945633142271042
8057405216243595195
-7389439858234957818
-5389453858436958168
-266893549648994617
3040328401474530651
6158500871224119394
-2841676129656881967
4715442001886462944
-284442997366536173
715406001842462900
-2727382865693190624
-7727523866482191789
6719184207199359959
-1277067587393743060
-7720011455952398211
6726696617713153281
279996543863601173
7283655748413496857
-6162947324507053330
-5163066325262054561
1840848880823843395
5840852880867843487
4840715880086842414
-4046904952599809426
-9165709055872875620
5956877252529086741
-43144747296912569
-1604866719326634456
-6604751718355632709
-7604888719168633942
-8604769718409632655
5395292281504366735
2838091149470021485
5838214150045022184
2956108618420608905
4956126618474609139
-4047806587665289083
5399048486759263580
5156370773381774555
9156630774705776151
-4290228299766776524
-4847411431971122436
946699215012338966
5946584214253337859
-7496262653600316163
-4496395654369317320
6942933009551442007
8382235673310200820
6264232204593613606
-4178747664009041637
1063815048865447049
-1379124819653208034
-2379261820462209275
-4379247820452209357
9179879420614690447
6179724419779689236
6618922083065447616
5061825951620102967
7504765820134758058
-3941819252743792375
180604055055169479
-7823160150035726894
1619650717341926052
4619805718368927775
8505548454445236460
-6941072618461313849
-8273296485558712517
-7273415486317713764
6730370718823182775
5730521719802184390
4730384719025183341
4287430850224527380
6287448850278527582
844641982688873856
-4155499018100127309
-268886646698338239
-7154752383833648999
2163040607327628261
3471965724367244818
-3531693480182650642
-6531816480725651453
5353288621685179703
2353421622418180700
2478695500618560154
-8424110050280813309
6904717554955151340
8904735555009151318
-8541903517951398969
461773686652496701
7461900687223497572
-2539026947967982415
-1538889947190981142
7461031052158017715
8461136052903019092
6579813155637084319
-5301319902100253987
-7308850312940048311
-3308846312896048251
-7865809443640391823
7820378771178228515
2820237770657228086
-5183558434685668615
5702343302237640989
7702329302227641319
-3744255770910909874
1135013190742086467
3134999190540085909
-3197365677142313316
-5640305545736968503
-8075733003501829416
5370870069386720811
5928085201623066659
3685645489515579384
6685544489022578691
827494981788980052
-1172491018201020094
6277846260132427404
5277709259355426347
-7169012814272124935
5952941860558359871
-3047203140006640650
-8608059476818882548
-2289743852863129386
-5289642852158128373
-6289779852907129222
-5732564720446782766
-2272840038915065759
-6719522112518617217
-8276586243967962122
6170121829697589402
-2158546774951374352
-3158683775760375553
-1715880907958721415
2284379093365280181
3284260092574278990
-3841172786213101111
3158986214629900032
2158849213884899151
1158968214639900190
3601908083158555273
-7844932991499998016
-5833678375673307423
-7283993654004755131
4047468682330031577
-3395612187041625063
4928686579058965613
-6517930494079585324
-7074211991214451843
-5074225991224451769
1929433213325443915
929552214112445114
6929574213890444536
-7517165859759106844
7486533344878788752
8614798793761585963
3168235720721035056
5821099149145127900
-5507078822517359344
-7507096822571359314
8939629250892191652
-1064152954200704555
5821744782934605757
1821708782890605889
-9181954421703290111
3261043446953365142
7261047446949365330
-1939629710310803463
2060630291013198133
-7939651710392803797
6755259377998476531
-6691599696714076992
-1244780622073523653
1312164508616819973
-1805719959600766714
-805614959043765769
8198062245752130541
2312947142927298399
637187908693888049
4637223908993888877
-5247895193618942845
-8690716061410596833
-2244015987817045493
-7808628529824183580
5195052674759712046
594354776006627907
-1962878356219717823
7037298644597283282
2155175112774869721
-4844983888056131462
-5844864887297130495
6598132981359524758
-1848585092512027184
-1287901756552786603
-5287905756596786919
-4287768755595785006
-2288652390863265229
-288666390873265147
5154428478508391411
-8914464863762678881
413439106341806001
-5029367761183847365
4531492575592394249
5531373574865393154
-6915348499066159040
88534707019739220
1420790574181137744
1419888939115658319
2420025939860659200
-8583893266269238848
8862969808231313935
-9140852396937582232
4305750675950968059
-8261875436896588399
-5265476641576484497
-5377744807982831194
-7377762807972831044
9068963265682720586
4507987928147477649
6508005928201477851
-1934955940447177718
3065185060409823831
8065326060926824308
7065221060437823699
2190609939333204140
-809545061433796799
5190476938344202375
9190512938628203011
-2252347929235450937
-8252369929269451135
4747555070055547950
2183097528579409954
-6259864339809244567
-1134449461011864348
-4134572461810865895
-3134435460809863982
-5363951565728187051
-7920896696482531061
-8921033697231531910
-7046289575185911002
-3603500707650257526
-7485487238471669174
4957478629964985687
5082138874375887068
6382915985015043807
382893984981043609
2382911985227044227
3383016985780045156
5707939385348112587
-4620747219322851425
-8177829350826196308
-8496378976475952232
3950343097199599450
-2053435107881296665
-5513159789605014384
4490622415459881951
-8509302583613116358
-2627298052801704596
372824948001296711
-9070887554893837092
-8071006555424837523
-7070869554647836474
-67242350353941334
-1952321452846772720
9051597753027124816
4051456752430124035
6050797118662646484
1050656117889645239
-8945613676693457638
8500993396239092897
-2945591676659457448
-945573676653457614
9094462885938385286
5090670680639488645
6090807681448489886
-2913093524691408320
-3027130786863096591
4972909213208903305
9095332521007865159
-465527815784376703
6977297052051277633
8977315052041277515
5973691847519381699
6973540846536380068
-7244570757266327934
4202270317152224827
5202151316393223580
7759352448651569694
-1240792551973430931
-5243683122430849003
-240041917918953337
760095082858047992
7084375848696637802
5634706203962667503
4634825204717668542
1867700512809885443
3867686512607885141
-3250879589215178639
309958747543063025
-6693924458286834451
-3693801457711833752
-3576039990329248748
-4575888989282246797
-4375644834375081381
9067458034758574441
5861391680921034810
3418451812342379591
418328811539378284
-6592842803508310786
-3706981066449000502
-3149765934180654494
-2149884934935655725
850238065607344830
7296682137888894474
5735861801184653052
4735980801943654043
-5710723271693897389
-8468200558891408887
4978402514041141532
-464404353548511930
6961740701383079699
-8485136373063472642
-9042319505331818906
4404507569092733905
-4599393636727163429
400747363837837128
-6916771625541437162
-2473845757256782581
-3473982758005783430
-3924161035524229969
-5924179035578229915
-4491669206292325427
-5934472074045979437
9069451131871918127
-8377411942628634656
-2373633737287737773
3630144468001158950
-1812694399780494968
7637660878558952620
-6809079195362599432
-8809065195096599018
-8252138064428255186
9194725009816296853
9198481215327194426
-8691303727714013806
8755559346786539225
-5691180727135013099
9038362052565301884
1591780979474750959
-965420152559594547
2152720316933993716
8595696185560648723
7595559184779647650
1595537184985648316
-529754693268731380
-1097982440009765819
-3097968439743765133
-5097986439797765367
8138693073229347555
4138657073201347687
-6857749722158756463
-2864970131364548445
-4864988131354548295
8581614941770002764
-1739559252355167518
-1296893385346514597
-2296774384623513526
4620290839673975123
7637093652853037385
3076374316897797096
76251316322796397
-2484450019658444218
-3484587020435445267
7637995288174517586
-1365937918157381084
-365800917376380011
-5483703385391965908
1516199613903032963
-2084649285833052775
2919247920214845195
-6527607154405707868
-5528371788726186348
6475428416648710661
-6409557685183119664
1037023387911431229
1594206519891776533
-3405934480693224008
-3406580114446701705
-5517401116436959009
4810639854700527658
6810657854754527644
-6192377716103890229
-7192258715316889030
6250588152296764472
3368482620480350745
-506893134880746982
7936068733703908459
8935949732944907212
5497802635036879185
1054876766752224572
-1945278234078776687
3054894766742224422
8055035767327224979
-5388067101870430963
-7388085101860430821
-7831006970405086046
1729853366387155808
8298071112958190037
5947293336854386967
-3374255859373786194
-7932120625439610191
-4931965624608608932
-5932102625385609989
4404054447851686653
4960981578552030421
-1046296830523760923
-8164473300321350006
-6925670792665757873
521166281704794588
-6708234822310526870
-2147515486275286277
-8594215559868837681
8295464382327368710
-8151293691584183256
-4033240222365595136
7413344850500955337
2409703646005059599
3610084801689226312
-8671398044778357164
-2667619839677460873
5782598437912985562
2339809570377332086
-3228559176932703230
465065448523711562
-4977997420793944836
-7977896420088943791
-4328908197646748895
-3779205475924196401
-4779086475169195362
1663857393137459269
-3454045075070127268
2914574150347219426
5914441149326217509
8600390633617640920
7600253632840639847
2600368633583640730
1600231632806639649
1596731429083745156
-2410784981474048482
-4971742318987291185
-1528665449659634829
-7603044093174944268
-4742244214314968766
-6735005805343177510
390427073704203351
947642205940549167
3506606446388448264
-8936615423548208677
-7936478422771207620
-4618963433435933606
1945786109636206690
5942033904153309241
6049758334588147235
-1950281665227851925
732225345006872595
-2385947124746715908
7614334876627285822
-6636530880935474404
-9079470749530129591
-1918603044132414919
7077785751173689029
-7483215586203553366
5203073629384068409
-3357905707959173812
8642394293468828144
4517730048981926303
8964412122585477761
4960651917266580984
2960665917532581398
-8818294023490369214
-6818308023500369068
1185488181830527625
-807273409165680991
-8693020145305989672
8753586927626560871
-1692861144730989249
-9135942013846644865
-6935423857365477159
-5935542858156478574
8694289821625834555
6694271821571834609
3369244421450766217
7812202290035421510
-3627158374105338201
490895094889249343
3933715962680903331
5933701962734903797
-3908552006934667015
-2026327474615253081
-1026446475374254312
6977349729988642589
2977313729944642721
966315115653954432
6416634393997402328
1852158852467264362
-708798485013978373
-3151738353564633688
-9151760353406633174
2562570278968530697
4005373146530184315
-6998290057807710917
3444689810794944326
4444538809815942711
-6440461292041887516
-447621759006218148
-8365788239271014215
-4040879839908947110
-5040760839149945887
3951903751153261568
2951766750408260687
3833854281930673428
7837646487489571053
-8609111586421981129
5837628487243570427
-6209906485884066381
-3648949148370823486
6797754925234728042
5797617924457726769
-8091907016971478715
-5264509641502027935
-8707554510573683939
7739171563081867691
2853547827536559669
-5383470687773556672
2188640265057376235
-3815137940251520680
1627700927594133302
3627686927328132632
-5939784184924423143
-2400257488542407727
4599901512332593544
-5725284888663475863
3160598848269833883
8352857959906729837
-3090002907972924303
-507963918987245871
4609970549280340514
6934860948848408209
8934878948902408411
6484682671069961166
3359253792326581125
-4749298169084869151
1250723830949130791
1568371821273406570
125312951999750184
-2313870711084007638
2460528390051567153
7460701391128569030
-8543134814286327823
-135332569645961696
-7135491570488962839
2868290634651933512
-253382038868549836
8325178746224233621
-4678726459447663357
1206356642865167537
-8240210429963382718
-3236569225419487076
881452243543100756
6324291111388754690
-4921793805334628695
-3423450385060590478
4019630484311065906
8019634484099065422
2584084025551203106
7580468821069307570
4144904362303444936
-7301680710575105489
4702119494763791392
-6666640731218555667
-5872703085284095974
119806503996110046
-5997976963484475428
4444970904898179447
8813604130293525651
4113529672303259565
-3333307402327293632
-7890270533039637284
3231410140520846312
8674249008302499974
-1778799897295902095
8339019570260683343
-1539232755387832050
4464289448417062777
5246457218661843199
1246453218617842851
2253846628644635942
7253987629229636499
7571379618289910710
-4757324986659053904
1685618881903601535
3939940843357256698
3797085517647336536
-8088921220052974621
-8956015930535800390
8490591142396750145
4929368500838767949
-7074431704504128900
-2631505835963473775
4811575033152182097
-4192326172667715237
-7642403449709161291
-4091858151482669277
-1091735150683667954
7911910053664227396
8769048100855794356
-2673780766719859192
3894468979819174909
-7552404094855378396
-6833660726951706273
5613061346723845145
1052342010704604792
-7515893735868429527
-1633889204737016877
-6076847073309671938
-8240034336161147774
-6236292131168251599
763866869706749928
-6118242661945663443
6885406542446231991
7449878083916369913
-5996724989260181298
-3786783429120743159
-4343998561613089743
-7790543634407640064
-2225963092592501897
-8229741297693398188
4217012776222153798
6899487786424878606
4899469786434878724
-8330177318910444596
7109155344798314039
-2086863971949478092
-3880682617352937394
-8873311207356144485
123077587949959463
130333997183751313
-2755271738371556635
5691190333995993179
318951904052750793
-1980876636979981304
-7981154638613983862
8022905568116914967
-7988411047591774888
7461966230605672098
-8974466804582129986
8472140268318420389
-6974448804336129376
-214112947209201294
8671770789948109260
-3221108052186253383
2782670153102643340
-1534981837265632499
-99435378441769379
2457765753528575807
-1542494247795425821
-5521192594818987848
1245968097376795823
-9189723362012067754
-2185840155926169542
-8632540229807721618
7006422955498725720
-3418975465402388399
-6736490454993663221
-5297443792466905800
8271038810799090353
827957941427433969
7278414220583882776
2027693463582123305
-833074414957851585
-3283270692786298820
-6283425693557299769
4284828052993734182
-5715197946812265320
-272391079030611182
4059342155144310804
6051847744604517372
-3951934460716379725
2605430974769704433
4170007516780842790
-1272799350744810580
3937009208401626102
5630647833836040328
-8259133109129167396
-5606269680673074664
4393756319132924838
1836555187162579672
7711303308980200160
-8292500896134696267
-7292395895641695708
5636960665828891411
-6599837848209223060
-5599700847208221405
-6149403568898773703
8286067888742086892
4160758010753708150
-4257109999343611847
5860709468180973459
7178462458998249847
-2825319746094646426
9065926021602280000
8183806489787866605
6183788489797866727
-7377977482151854926
-8263821218933164468
2515257722796787281
958161591095441794
1958042590336440825
5397363254409200346
953535750771065392
-4921212371110555224
-8058793464914429671
-6383679864498497348
-372645249911808449
-4376405455210705328
3184436881335535852
630831651100348477
-8930028685451892597
-3926387480955996855
948223640148622714
-1386735796399192077
-2700764582293572246
6185119154639737496
3724597838339541191
-6035861019586388180
-518697508631425659
1200263233485735432
-8128542371912229421
-5685602503393574336
-5703183951095115476
2425886132400160849
2865051795429918701
-2578011073631737197
5618127243791055921
-2148914447613726391
-6159931062146415300
3094293898602238746
951420572902318966
-6491404294933335370
5955061777414214628
3833526104478731847
7394364441236973511
4645077198390733438
7878086133896463164
4635541421251975104
6078344289069629246
-8368395784867923046
4303166553155574827
-2696736445927423374
-138889680107600025
-1256788148331186620
3746853056228709186
7546612901109543094
546485900534542453
1315009618498473661
-5685149382072526764
-4685012381295525749
-8563498708650043882
-4677755972317734407
-3371239597013147908
-3228384271303228006
-2228247270302226095
-6346300739520814215
-2034168062596988170
-6034172062640988486
-3026760652624195547
-1026774652826195893
8733716205359733790
-6152189531591576162
-2901486774679816593
8308599786100622347
-1702694829810068100
1740126037981585888
-2377671429476999320
-3895054941927964525
530848751124349321
-3915577320911199709
-4480048862397337587
-1029971585579892097
4970306416006110305
5405715873764971194
5848637742305626393
-2601420231829081368
-7483543763655495143
-5487281968920391812
-8919090222223357239
198848245836228716
3746420612845027050
-3578642787560041946
-1578624787506041748
-6365086022926708021
-2929521564160845391
-1929640564915846432
5756731651366776550
-3612010574565570785
397242931505564187
-9045567936064089227
5401140137601462297
-6927564467091501561
-3717741907951064981
3732595370398382489
-4396474713128893708
-1835741376927652987
-3835759376917652833
-8031637693064444227
-5197200702793464225
2802807297246536023
-6522242102892532323
7924497970773019201
4924342969990018100
-6396968224948153401
2589127531890201053
7596780943228995766
2269742446020584054
7263346613600732510
-7190905870850613172
1812995334969284166
-4187026665048715788
-2747980002569958761
-747962002515958563
2063575091370043114
7497132452884561764
-2063727883907680094
7612369293897193240
-8834356779822358514
496702181072361916
-7503593820279639580
5947021459447809684
821606580646429455
-5182171624642467270
2382426917414671257
-5813711400072121925
-7388356979267008104
2615425226049888969
-5028991260192797058
8413855607660856960
1410196403110961308
-146867728338383595
-6840647354657799328
-5603787840210684334
-2482115166690201194
-3478495961956304702
5626661657638885119
-2819800414696664771
2493976369613713098
-2366809508980261782
6076152359408392737
-5492238387967642597
6504465711645201248
-3381299024709108173
-4255906145781727386
-7042349381148393717
5839782150254018914
4046496764963548976
4054009175749343326
-4182785338248771093
-8057515460092391911
-5064872869819184144
-1733532638025265853
-8851453106026851602
7727115678845931341
-2715832189532723552
-2708575780282931506
8852526557827312102
-5516931871002486896
7933427407380960960
3490469538808305901
818287567137330443
-8503907262844320611
-4060949394271665296
-7710528027833427554
-7149588690342184679
-8345568006997976676
3543938934441229122
-5041846259853346443
-7484786128448001888
-4484663127649000563
3401083608475308196
6526512487506688907
-1913077480394809437
-5470415613430156594
6851000582045015586
-358825977155420974
-8930817928939351690
-5369979592181110026
7951349602759061249
-1251238547469584119
-7505564508903239248
3166881464375738634
5166899464429738864
-7468440516386812822
-6947449472089792515
1728510704906079580
3288685408108844119
-2711304591685155515
6670672465634268947
8556653203196579720
7948446893985702497
-937436842931607517
7768176858078358290
-5113954673580054853
-3553102336811813291
-4552983336052812034
6213925354582969315
8342973438096245566
6189759144033325615
-4257846564893706064
-5257727564138704831
-8700804433466361123
7520467742563767493
3516675537008870086
4840599462703862798
7397800594994209068
8722585993781275470
-2724031079357275465
4836843257444966243
-2263527763047078846
-4271026173614872626
-1811468762119777118
-6940383844640051830
3638162940470731911
9206275686244764875
8324188154674351824
7398631798606661688
7193881469854268501
-7260115012837074269
-5935329614274008475
-8591725246688996314
8862426237057348309
-2266542845480926197
-3025995229993781911
-6911092332540613267
-3356822828991224126
-7361228668063598860
8517947292668395884
-8767951075485440550
-4771703280956337845
5671276587666317392
-7207130738765198908
-9207116738755198978
-5221193982773845879
7782743223410052415
461436028263880214
3844703788726806478
6527178798961531478
-7358589937244777363
5563552157167479274
-2890682584037275637
-3890819584814276652
1544762873717585184
-6748914495015758455
3251367506358243575
5254885710391138776
-1191558361922411092
4812219843382485857
7937392720817863936
3386710421554370087
7478652512733220686
4917951176751980069
-282465978976186486
4610596224687453206
4941167822436894045
-1057952542303625894
-7057974542385626232
-7183504421866007218
7834244026558534803
-165795973545465285
-6169574178834362026
-1323705004474895038
-2210194375077682787
1132414472776926617
463750704786845608
-660758538837054786
-1086776593449646556
7913400407431354867
-935949748105096019
3067810456941800068
4489563673511019043
-825114746136838945
-7277482017937763537
-5295045465633304607
-3291559261920410222
6022205592682717526
4697494136307113064
4837684718742000390
-601365943784756897
-2604494515308175827
2280739588051656760
-5024074905263842849
-8349134305416910889
-1337962690305221735
-6183831864696688691
5576644993511241222
-7595304912654505661
2858911571784840089
5284915626131431417
5953579394093512194
-5385537249890202479
8179083291996935578
3174540452399560541
-6637171571708691638
244937959911721367
-5086388271920197202
-4647222608650438774
2606984352060215314
-7839463720297334614
8200594842344508448
639720505558266916
-360384494934733643
3514313626604886295
6957390495980542955
-6489468578488009978
-5046409709390354060
5308164272008345585
6182995394588967366
7483087310385189621
-7963789764073362950
1597326573998880188
-4842117090584879970
-6831250779365929435
-721980443721545552
-1829585873417382293
-2059083978137705082
4627183237363916621
-9045161734922059274
6519476806919078477
-2480668193641922274
-591874827809654669
-7278142043567277172
-8274522839089381384
-7717307706597034768
4743207609281160647
2056976393823539020
6459923699638350593
8459909699372349975
-4425978037524959779
-4094504804738039741
2348439063888615756
-2512346814961359892
8708752360243767625
258278081117318884
7265949492506113547
7734445005828304333
-9144190321895213851
-2508904341176662231
-2048928297371666315
4069111171644921459
-488107960667424881
7526284554176419967
8958330808961387452
-2825316495796585570
8965027945689978971
-7160549933950402575
6328008869454085969
-922729887773674204
-5125145036909317713
-5582178418720239919
2545990029501556303
-3904210248050890128
-6904365249093892053
-1352932315759920358
8939220707786185310
-2503896161629471198
6706204399096967608
-7489955918423825768
197283758574659585
-4349610335189937101
2417376459854712213
-4687652401249709790
-3928200017056854908
-7036693081856171470
1978209065824574247
3613386045962125096
-2129487364414263467
2184408420667115619
6113530251130504317
-3886495748707495361
-2454705495458529924
6782194019060585190
-96415308824933540
1907358896483963221
-9020242569147281890
2666165647163340944
-5013142463389228316
6437230815004219214
-5898042623189598071
-7783767359467907092
3763285734883690035
9213605013227137867
-111444386959930591
2749323491628044459
6756871902441838709
-4815275050173093300
4882127780588218185
-5703675413724357458
-1361410429514384644
-6254806834008898035
191637238080651225
-6686716088012864449
8317207117905033099
2874144248539376545
-6237225386243356575
-7588378164638163170
-5770137307181057796
-6209302970466816480
7237300102721734709
2325532988800688306
6982617424015263755
3414266676439227853
-8234985547322968859
-8360291425523348325
-8592873429166825073
-9035795297707480288
-3276544275225902971
-276421274438901622
723459724834097281
7395901697861074527
949201624235522947
-5364712160899856113
741041172583638581
-6270130442784051389
7292865377486234297
-4161232106162110292
-7489973769578614435
-8486098563596716567
-3841500937953087637
7301517388567833702
1830804034504888946
-7733780507306249147
944960297467578380
9082490625628998409
-6032657214426631468
-7032762215239632923
-7158068093440012389
-5715009224102355943
-4346530999522010552
7636490825137648383
7629234416111856945
-2600289688622465762
4925534126353181729
4695031998360726172
-5548317348868241000
-548176348047239669
6455482856502656063
7102537040333046812
-4233501032149248553
-3239287231047622718
-5773269986924675698
-3473185444055940411
-5547065374611946666
-2762359234746621721
-6606499481409674037
-4488464012437086531
4414099537132285176
-6579494630017862290
-6583250835532759869
-4248035397448942774
-258386705672313678
-3410895965080918002
5150083372514325217
6718160118244358137
2084207601051673062
2176113691990522905
5948340753284292141
-277167144631131335
-8404500132661066458
-3061873284528456248
-2061736283751455185
-6595993041154510107
-4035035703637267442
2407908164985388095
-4477989572181922377
-1477834571346921172
5713014937920165769
-266612986122336493
-1893973624410841323
-8271228722369845310
3728815277490154198
-1713991590099499492
886720308663584531
-2113178690855415018
-3238589569580794755
4647413168079516052
203251463786508407
5963738322232438878
-6040061883174458353
-3182736478163180292
3820922726386715360
5706344191507825718
-9179561545443484234
2396085611150343002
8923423159850053928
9130379775893585932
-2630097082058343181
-6981148859720148373
1587086886808885540
5587122886836885408
-2863351392293563325
8708763560325368868
2353969577414666795
8128505679583243627
-6315309392483863834
3009772007719204112
5620442535590473483
1052210788805438774
2853317843458689854
3617227602782777289
842846501417201550
2943300522656247996
-823705168688534512
1026888672378692933
-1298289728721376820
-2290914319004584677
2707519855514695474
6815248286057533876
4376966258071255609
-8483512903543904044
-5476101493799111825
5726472656163532877
1175002826479428070
-1828317107061269531
447397644319813678
7133408858573433781
-9212881193929071613
-2644663447358037130
-1964167534274656346
-1304753272343710201
-3304995273933712655
-4422893742093299170
-8294426931183223528
-1751271042943524239
-4513595997331796355
-3088118575759681401
-2638813346466022112
9149698301250936831
2038346666458203301
-526142875017934439
-4171145772160186792
7389988565950056336
-3167668871180030042
-598219288744642833
6505875937070299339
-1490375857486803458
5945192601099058576
3819644721564677600
7289520544701010248
518747274885843149
2822645753203672373
3028813107806213121
363026071972955475
3812457715228923422
-8577537092594110418
6785477830855995834
2274503685210781685
7592036674792056069
-7629098500201070516
-1201071336132923959
7702367835857715420
1043361473087907312
-4291107330729431469
852657668925964952
-3708317668645277943
8616327459839591065
-5273197481621614579
1711676439522387331
-1607863647374231353
1602071285682694082
8602230286237694587
7063855203073696823
4826295158480970984
-3834635940635905116
245170073794392183
1883376476350161480
8193534055954643057
-2259482849339758626
-7044206989263083569
-4483249651745840664
-1909670907650306800
-3052663234141228029
-8491251183816682310
1426144244057814596
-3358692269505998714
8504432231932962955
-7623698017321962840
-4805592090163108544
6744898938415762500
730827694591115921
7697921317504152141
-269620530311797923
4616259206801512351
8626700618973750024
-8083178479064909945
-640353611485256377
-3171321284640461062
-2171184283895460175
2828956716673540412
8046021685069769060
-7082273763951028651
927157639555241548
3269885488164851993
1553849747662134917
6291442923225351554
-8109793286902118151
-3900318848301728120
-5271733747232358004
-6146340868276977273
461073897687077027
-8210095891948580913
825212004163502270
7703565330513018712
-1632756942582150130
709944893639249564
5675178131106424242
-6645253738893652511
564572820242783793
3701339131568161889
435735599673143337
-889305800681925481
-7083407008369163240
359417859466491096
-1449057232044065503
-4885267324371405324
5653231896805341062
-9008925037793886842
-6216930488646770123
8532503536113702039
2241488058004423468
-8217837422471420147
2036843942643102910
-2140361463758283053
7863420741562613788
6943357686311161881
6757776550201397844
-8475158770269030212
2818819550873422543
3250728804941389085
-8191454429180787392
5805762942747256642
4986547532010670575
4385853633333586686
-2986674727438907115
8824437633825893435
-2973837578933146413
-3862493943988412715
395119817510087182
2820174307247949506
-3519446969668241763
-4627817822262492884
4756075562652254270
-7951567235515055279
-183764869825974842
1921090990457446246
-4291493300288812940
6958607494104131034
-1159514227928535208
-4372342278216563985
4972169293096900768
6006627476560013656
591743024806900405
442912898635693042
7866576113340895115
-4341766724811689661
4229259523827570399
4221221164136980100
-5778630938297884387
-6877210863258588192
-2144284217804152768
-2976933761878585560
4790107929558196912
-3206175865018905637
-6059457345737298880
6493581724141198741
-8344184689912001345
-6758942141122113907
-873181404731804450
3523968668931516473
-2378023649280419876
3594347865816291236
-4601790451622501802
701949295768128821
-8885069682816774814
3865463466240567990
4436696703857194132
-4780628265863036144
7318907785137551256
7342156431046465584
2470455971679919165
6762330993624022175
-978567319737022832
8417849371287704224
766832051768165842
5166023152376080980
-6945469483209653697
5081547367786156934
-468770502684675821
5219394751292749705
-2549689272203498237
7109260904701481229
-2081265111210072467
-2973677681520235556
1454068188007247787
5572121657225835907
-1293257957773648492
7876300673940894569
3541067235871077620
-6392418462462658998
-6925483313724611087
1395928881946561577
-57167024322842107
443748424298996449
5907221298687398924
-1541526768635629880
-7100390008334527804
-2208197439532367343
6387087975193770559
2850367919157922070
7723241944697200189
3588426558825683351
-1953157642467237515
2840784003483222292
-3288086889604257964
3752082673944586531
322011515950961818
-1862396277886347795
-3356135166980817710
2369354056312575099
-4247291014640570922
-1818608831920242374
4957801366570676979
-4350774118563465177
6003831336496592001
6362359524660190859
6569012000551779051
-4799035831110725204
2929797094746327749
5753024495996599592
-23625053264343968
-1991783242057111803
7118972759448144772
8610942552777272887
-6371157878623138908
8075550195042412872
3629577244055910406
-660152330539825076
-4453988975677283684
-3856154743789177934
6689024254240076864
1685127048144178754
-6432674419326406562
-5432793419857406993
-5740148371925933882
-7492106985145719459
-8931153647420476080
2729111190626408579
-4976168389897510937
-6850880511687131557
-5421686840411739502
3940307365339924233
-5881091356465260065
3713873141839444525
-7256910573245396514
8293646724873095388
8736568593417750581
4783946863855560712
6718676536613592056
7251741387843544019
1368382100401604712
3036926867604684520
5779833930274639409
7116875195131178045
-5461355180342040702
-2137715778200077463
4136187443925457351
6696888779902697750
-9061828969851678390
-5281817566948863661
863356787255652960
-2611831146743123406
7347583870493810379
3972456192477785643
501174938575526146
7139336849268940543
5246141644644299038
2131451573312950491
5475971414084036126
-1964490991768378771
8592306961204380723
252983656834218346
-6409133277725009790
-2597010810359075675
6529847503002197165
6153924391977698761
7312924884970992973
-7361625848712741016
-815198876455192216
957630088479857345
3932429241903732643
4136380367039673024
-8753953007931296119
-1843921060214341675
-4458245011278275078
4585410756047464122
-5189774979662589703
-8780119653771094858
6613336256439380973
-4741393399987719483
9066598418877635793
-6596826271593118393
-3754053668725070591
-4498992365827597394
-3760933726347836551
8719892509048178531
2168515087433636094
5851127098417361943
7594028509049751156
-5769304345757607597
5942580068307165204
518807297849537945
-4081540261748731445
5184213573444025305
-4694038752172489928
1498101358485403935
7761820454097708905
-3593286523786250302
-7274130935521678793
377872747222364124
-8817405446696378563
2327504309227366054
569940021530854113
1797701934329285597
