-4842117090584879970
3094293898602238746
4637223908993888877
-465527815784376703
6493581724141198741
-4694038752172489928
8183806489787866605
-5383470687773556672
1509707312768337838
3752082673944586531
3932429241903732643
-9045567936064089227
9149698301250936831
-8612737995048623998
-1520473749037658594
-6489468578488009978
5837628487243570427
-2480668193641922274
6926244324609892988
5150083372514325217
2936563632577263124
5154428478508391411
1175002826479428070
1790630374868647951
-5183558434685668615
-1091735150683667954
2868290634651933512
6621328949299074002
5727179283235569021
-4040879839908947110
-1528665449659634829
3506606446388448264
2820237770657228086
-8817405446696378563
-8320373689946067773
7139336849268940543
-2864970131364548445
4811575033152182097
-6693924458286834451
-3744255770910909874
-4599393636727163429
-1950281665227851925
-3238589569580794755
-2945591676659457448
-6645253738893652511
-9165709055872875620
4972909213208903305
6090807681448489886
5840852880867843487
-1449057232044065503
-8209651626505353779
-5163066325262054561
7473164687826110412
9128959745023160305
9146509192468700917
-3356135166980817710
-5189774979662589703
6934860948848408209
-5898042623189598071
-4552983336052812034
-1050994023208902753
-2752119047024900440
842846501417201550
6010787275257571576
5184213573444025305
2168515087433636094
4585410756047464122
4986547532010670575
-5363951565728187051
5359369588772834743
-5013142463389228316
2152720316933993716
5838214150045022184
6508005928201477851
-5996724989260181298
-4425978037524959779
-3478495961956304702
3168235720721035056
7820378771178228515
-8252369929269451135
-3915577320911199709
-935949748105096019
-3578642787560041946
4840715880086842414
5956877252529086741
8904735555009151318
7834244026558534803
-4458245011278275078
8256920922884334326
6961740701383079699
-4780628265863036144
4054009175749343326
5247920953015099584
8257566556637812025
5244246852161070930
7251741387843544019
-7377762807972831044
-1848585092512027184
-5024074905263842849
-2026327474615253081
-3395612187041625063
-1026446475374254312
-7951567235515055279
5726472656163532877
3905069941818076706
951420572902318966
4978402514041141532
5945192601099058576
-7083407008369163240
-315342960042848847
4248039953806100751
8490591142396750145
2084207601051673062
442912898635693042
-4047806587665289083
5576644993511241222
6755259377998476531
3812630496047239920
5160330435175345822
-3693801457711833752
309958747543063025
-5273197481621614579
-3928200017056854908
9122390911750307690
-5377744807982831194
-6831250779365929435
2158849213884899151
-5839832565699655443
-4805592090163108544
-2432174593375084007
1245968097376795823
4019630484311065906
125312951999750184
2562570278968530697
-6383679864498497348
-4628321180307498093
7394364441236973511
-5097986439797765367
-7920896696482531061
-2149884934935655725
-2508904341176662231
3884291561362839346
709944893639249564
-2378023649280419876
-4328908197646748895
7482525821744759509
-1538889947190981142
-6527607154405707868
6006627476560013656
3746853056228709186
6782194019060585190
-873181404731804450
-3706981066449000502
-4885267324371405324
7476760589625268543
3054894766742224422
127578908485806392
-7046289575185911002
1132762216411335839
-3270956690720838371
-6940383844640051830
4836843257444966243
-507963918987245871
6287448850278527582
-5492238387967642597
-5307971550110056052
5839782150254018914
8813604130293525651
-3047203140006640650
8753586927626560871
6929574213890444536
8804742921198031305
5804619920623030604
-5533197189576067599
5702343302237640989
-8753953007931296119
-6927564467091501561
-3088118575759681401
2347973810368732059
5914441149326217509
-1633889204737016877
7301517388567833702
4925324689486413355
3940307365339924233
2929797094746327749
-747962002515958563
3728815277490154198
-8132909213241034354
-5090531322583414664
-9181954421703290111
-6059457345737298880
-5292942471963059053
-4033240222365595136
7614334876627285822
3253007787485187171
-3815137940251520680
-6093784317638569039
3620560314982595526
-269620530311797923
5805762942747256642
-306626713584702071
-5095107059002924325
-974948214077502397
-8175048003539471998
4783946863855560712
-6270130442784051389
-8577537092594110418
-3786783429120743159
8602230286237694587
4616259206801512351
-2051131023989903826
6324291111388754690
8697050490955193511
7289520544701010248
-1716547219669564708
-6517930494079585324
-360384494934733643
3269885488164851993
639720505558266916
-8128542371912229421
-7602563957335875707
9069451131871918127
1052210788805438774
-5606269680673074664
-5770137307181057796
-8377411942628634656
-3171321284640461062
953535750771065392
2470455971679919165
4970306416006110305
-4921212371110555224
8324188154674351824
-5997976963484475428
3543938934441229122
-2976933761878585560
1553849747662134917
-8483512903543904044
6844176116329675849
-7042349381148393717
-2147515486275286277
382893984981043609
7084375848696637802
-8485136373063472642
8610942552777272887
7546612901109543094
-2744606636255106278
-4324468162930245863
6250588152296764472
-6078338515107482389
-721980443721545552
-6306904715218704629
2163040607327628261
-2190087081896469323
-6809079195362599432
-7135491570488962839
-9202493221760481170
6942933009551442007
-815198876455192216
-5064872869819184144
-2148914447613726391
1907358896483963221
-6904365249093892053
569940021530854113
-4931965624608608932
4960981578552030421
2840784003483222292
-8930817928939351690
-1778799897295902095
3696877490134192400
-183764869825974842
7812202290035421510
-2316595484593170922
8382235673310200820
8298071112958190037
7697921317504152141
1852158852467264362
7256815922327333383
5190476938344202375
6328008869454085969
-3880682617352937394
2478695500618560154
-1412463047763197934
6982617424015263755
-1064152954200704555
-2313870711084007638
3972456192477785643
3349960185284564716
4695031998360726172
1419888939115658319
-1115593437686158905
-7932120625439610191
3867686512607885141
-3751354412512421448
-3027130786863096591
881452243543100756
4790107929558196912
-978567319737022832
-1812694399780494968
2874144248539376545
1568371821273406570
191637238080651225
-1078453515786483402
521166281704794588
-2673780766719859192
244937959911721367
6179724419779689236
1919404456791921936
1728510704906079580
-2700764582293572246
6957390495980542955
9156630774705776151
7580468821069307570
-5287905756596786919
-6289779852907129222
-8276586243967962122
-4312939383521141502
4645077198390733438
2038346666458203301
3698337232083548513
-4854080174949497665
-3236569225419487076
2493976369613713098
-5513159789605014384
-3530498516767785588
4042431966963759443
-8129153007982137565
6128804744224159220
42427966967759255
7756633728210171144
-989115724037427557
966315115653954432
-578156641762363345
827494981788980052
2409703646005059599
3042294965962757528
518747274885843149
-7382441326522573326
6482420820999758130
-5078457515830483462
-214112947209201294
-5086388271920197202
-6035861019586388180
-8217837422471420147
-2601420231829081368
4303166553155574827
-2727382865693190624
-4233501032149248553
2853317843458689854
3401083608475308196
-4647222608650438774
7782743223410052415
1616786109481698063
-2144284217804152768
-8075733003501829416
-7629098500201070516
-266612986122336493
-2482115166690201194
1420790574181137744
-8632540229807721618
4136187443925457351
-3473982758005783430
-1713991590099499492
-1244780622073523653
2782670153102643340
245170073794392183
5405715873764971194
6730370718823182775
3010920276006572535
-309179178474245125
-7507096822571359314
-7260115012837074269
6170121829697589402
435735599673143337
2615243982215418774
-7839463720297334614
3629577244055910406
-5260649651987088163
4287430850224527380
-2578011073631737197
-135332569645961696
9206275686244764875
-5301319902100253987
850238065607344830
9046073171251654509
8794289579418543667
1836555187162579672
7397800594994209068
-5630468373378416690
5475971414084036126
-6748914495015758455
-8496378976475952232
9194725009816296853
3746420612845027050
-1240792551973430931
-2129487364414263467
4482402820945758152
-3856154743789177934
-3576039990329248748
372824948001296711
119806503996110046
6973540846536380068
-3904210248050890128
4837684718742000390
3732595370398382489
-1829585873417382293
-488107960667424881
-3206175865018905637
-8259133109129167396
-8252138064428255186
258278081117318884
-3432055592616082778
-3097968439743765133
6913268882499481459
-7432059592404082070
760095082858047992
-240041917918953337
-7483543763655495143
-3288086889604257964
3247902953025099742
-3388534223137478077
7178462458998249847
-289045265883160915
-4483249651745840664
-5710723271693897389
2353421622418180700
1679310042378651050
1936426631796262053
-5040760839149945887
-5528371788726186348
-3090002907972924303
6125464748666004102
4404054447851686653
-6531816480725651453
6437230815004219214
-2266542845480926197
4817185265171864610
-8541903517951398969
-6236292131168251599
-7831006970405086046
3951903751153261568
3060490612540832338
-3595861090298905936
1250723830949130791
7236666175467998449
-7036693081856171470
6977297052051277633
-7601662322270396050
-43144747296912569
-1828317107061269531
-2290914319004584677
-4971742318987291185
5782598437912985562
5399048486759263580
6459923699638350593
-3517637179126242000
8459909699372349975
-4513595997331796355
-5934472074045979437
4840599462703862798
3713873141839444525
-5881091356465260065
-4094504804738039741
467854653740151741
-6746100647744083283
-6947449472089792515
-5691180727135013099
-7552404094855378396
-1929640564915846432
5370870069386720811
-3522198575349379632
-5715197946812265320
591743024806900405
-2137715778200077463
-2638813346466022112
2369354056312575099
4957478629964985687
6958607494104131034
7342156431046465584
1591780979474750959
-7521397384381138775
-2973837578933146413
-2539026947967982415
-4343998561613089743
-2644663447358037130
-8594215559868837681
7596780943228995766
-6636530880935474404
461773686652496701
-9151760353406633174
-5513826101327857645
-5778630938297884387
4221221164136980100
-5548317348868241000
-447621759006218148
363026071972955475
-2210194375077682787
-1939629710310803463
8616327459839591065
8626700618973750024
1929433213325443915
-7277482017937763537
6113530251130504317
-2986674727438907115
3627686927328132632
8019634484099065422
1315009618498473661
-3717741907951064981
-640353611485256377
-7755760251312795490
4924342969990018100
957630088479857345
3844703788726806478
929552214112445114
6416634393997402328
-1964490991768378771
6475428416648710661
5735861801184653052
-660758538837054786
-7292395895641695708
-5470415613430156594
1033816721290613934
-8344184689912001345
-7890270533039637284
7118972759448144772
7629234416111856945
-8273296485558712517
4599901512332593544
7636490825137648383
3028813107806213121
-4290228299766776524
6078344289069629246
5963738322232438878
-2762359234746621721
1361918053618377737
-8877588822182413621
-6209302970466816480
-4255906145781727386
-4372342278216563985
2155175112774869721
4756734728979172533
-6916771625541437162
732225345006872595
4113529672303259565
1395928881946561577
5942033904153309241
-5844864887297130495
7703565330513018712
5848637742305626393
248035954018101491
2183097528579409954
-5755742251322795648
-5872703085284095974
-4530635517516786435
-2225963092592501897
-4134572461810865895
3833526104478731847
-3531693480182650642
2919541457568923211
-1361410429514384644
496702181072361916
-9020242569147281890
8461136052903019092
-4618963433435933606
8286067888742086892
6505875937070299339
-3371239597013147908
-1352932315759920358
2545990029501556303
-4176422902180283138
-5985158251850250708
-5182171624642467270
7237193447717198432
-7274130935521678793
7723241944697200189
-1129282008947139174
-6539903023853922085
-7202475221706481200
-4741393399987719483
5090670680639488645
4689502080141399321
-284442997366536173
-760432988437306018
-9140852396937582232
-1026774652826195893
-8563498708650043882
-3841172786213101111
-6735005805343177510
-2667619839677460873
3261043446953365142
-9179561545443484234
2327504309227366054
3288685408108844119
8198062245752130541
2587540952280802350
7389988565950056336
-7489955918423825768
-3648949148370823486
-6388689223924479176
-2929521564160845391
4882127780588218185
-512794068235242963
4917951176751980069
2787171473654490487
-5732564720446782766
-2537905926744578235
2457803616542404093
-9189942151584218583
-4627817822262492884
-2272840038915065759
-7588378164638163170
4697014490911193675
-5547065374611946666
-5521192594818987848
1711676439522387331
3685645489515579384
949201624235522947
3939940843357256698
4404507569092733905
2914574150347219426
-6259864339809244567
3828720201351423909
8022905568116914967
2850367919157922070
3516675537008870086
3710958733904838649
4609970549280340514
-358825977155420974
-8834356779822358514
-1277067587393743060
-2252347929235450937
-4350774118563465177
8939629250892191652
-6169574178834362026
1663857393137459269
-3304995273933712655
5563552157167479274
-4921793805334628695
7504765820134758058
-6925670792665757873
-1739559252355167518
1870872991887862017
6051847744604517372
-8965261444411035302
7265949492506113547
-1172491018201020094
-7388356979267008104
-3197365677142313316
-8263821218933164468
5691190333995993179
3894468979819174909
3414266676439227853
-1287901756552786603
1368382100401604712
4313812860434517324
-5725284888663475863
3638162940470731911
-5872443091340192918
7394822415369169180
6719184207199359959
-4771703280956337845
6483290456065237989
-6491404294933335370
-3951934460716379725
7318907785137551256
6899487786424878606
279996543863601173
1833966078556927530
7948446893985702497
4899469786434878724
-9193714286190364511
9082490625628998409
8935949732944907212
7461031052158017715
-3926387480955996855
-2747980002569958761
-6183831864696688691
-8349134305416910889
5946584214253337859
6670672465634268947
6613336256439380973
-4060949394271665296
-2708575780282931506
1685618881903601535
7702329302227641319
-4408042312386689938
9095332521007865159
7312924884970992973
1158968214639900190
-3228559176932703230
5353288621685179703
530848751124349321
2828956716673540412
-3834635940635905116
4756075562652254270
546485900534542453
-2523521411748733187
-529754693268731380
6851000582045015586
2042413966701758841
-7074211991214451843
3313675859625516103
7486533344878788752
-1086776593449646556
2960665917532581398
-2470450211317525201
-8919090222223357239
-6076847073309671938
8964412122585477761
-6396968224948153401
-8031637693064444227
7292865377486234297
-6192377716103890229
844641982688873856
-8292841471210057658
-3356822828991224126
5626661657638885119
2951766750408260687
1206356642865167537
-3890819584814276652
-1490375857486803458
2312947142927298399
703579324144045970
-468770502684675821
-3374255859373786194
8342973438096245566
5587122886836885408
3386710421554370087
2853547827536559669
10765275175571242
-3026760652624195547
-1934955940447177718
-8058793464914429671
-3250879589215178639
6526512487506688907
1594206519891776533
4747555070055547950
-1323705004474895038
8179083291996935578
-8240034336161147774
-8655945395761165989
-4966205278807386328
-3966324279534387421
6049758334588147235
-365800917376380011
6183788489797866727
-3645735357732416904
9179879420614690447
637187908693888049
-8294426931183223528
-6324454162664245193
9130379775893585932
-5813711400072121925
6797754925234728042
5756731651366776550
8075550195042412872
-7468440516386812822
616649108700697054
-8164473300321350006
8030347819806455716
490895094889249343
5821099149145127900
2188640265057376235
-4484663127649000563
-2715832189532723552
7837646487489571053
8339019570260683343
-708798485013978373
-7303588876741005401
7759352448651569694
6810657854754527644
1052342010704604792
-7190905870850613172
-7981154638613983862
3601908083158555273
-6655927395515165363
-591874827809654669
-8700804433466361123
-8229741297693398188
4697494136307113064
2584084025551203106
-3410895965080918002
-3982701891595575995
6189759144033325615
5928085201623066659
-3405934480693224008
2425886132400160849
-7306785714459703344
7133408858573433781
6182995394588967366
3812457715228923422
3541067235871077620
-2228247270302226095
-3655804394968164826
4972169293096900768
-1539232755387832050
730827694591115921
3587421951489801185
-4685012381295525749
4465753277789317273
6484682671069961166
4702119494763791392
-7207130738765198908
2956108618420608905
2620423314205594477
-3308846312896048251
-7939651710392803797
2060630291013198133
-1607863647374231353
2176113691990522905
5779833930274639409
1596731429083745156
-2377671429476999320
-3924161035524229969
359417859466491096
6233332241905300962
-9135942013846644865
-8583893266269238848
5127719909274807567
-7625780603244790259
5952941860558359871
-1306763714361703082
-9070887554893837092
2872176636559084285
715406001842462900
8138693073229347555
-945573676653457614
-7278142043567277172
4810639854700527658
-6159931062146415300
-5507078822517359344
-260764653006089998
-823705168688534512
8271038810799090353
4715442001886462944
-7389439858234957818
-6911092332540613267
-296557676636955101
8934878948902408411
1840534911833780111
7460414977820080497
-2944189228057544610
-4277504556958806803
-1733532638025265853
6264232204593613606
-7767289030705899707
-5932391056759866388
-5200726113506927935
5695691654483839948
3065185060409823831
-7844932991499998016
5308164272008345585
5284225414690914020
-8780119653771094858
233310241887300764
-4287768755595785006
3076374316897797096
-7128402373671658935
-4187026665048715788
7278414220583882776
6820927470420761553
400747363837837128
7102537040333046812
-71019233546203287
-4257846564893706064
4244109851160069017
4046496764963548976
-3158683775760375553
-9071279048844153004
-5029367761183847365
9065926021602280000
-4687652401249709790
723459724834097281
-7169012814272124935
-7071261048854153122
-3068146477308733962
1597326573998880188
-2063727883907680094
-3025995229993781911
-7867382784409665450
-8608059476818882548
-3519446969668241763
-400525901828896492
1126193382942482810
-5074225991224451769
8057405216243595195
2269742446020584054
787153473600490253
-4129149007954137465
-9091771158315767194
8505548454445236460
3724597838339541191
8476641588870267502
-8671398044778357164
3937009208401626102
6236529174658997246
-9035795297707480288
818287567137330443
4444970904898179447
2589127531890201053
-8468200558891408887
-7783767359467907092
-5640305545736968503
-4742244214314968766
-8412622048338198339
5618127243791055921
7571379618289910710
-1909670907650306800
825212004163502270
-8931153647420476080
-464404353548511930
5219394751292749705
7478652512733220686
-7578315642593364536
6277846260132427404
1233447242664302071
-6968743648143929951
5061825951620102967
-4257109999343611847
630831651100348477
-5312820382794140407
4350097186097565949
-7308850312940048311
-2913093524691408320
-429636223750539488
8733716205359733790
5753024495996599592
-2263527763047078846
6382915985015043807
2027693463582123305
3738968195649774859
2904932941037075699
7259175568841790177
-9191306710136658354
-7149588690342184679
-8314147124186495753
-1763510825413002970
1160326435131345730
7739004195693774975
-2627298052801704596
-8932546057542867495
-839691564858654120
-7986077887193730895
8719892509048178531
-4498992365827597394
-6925483313724611087
-766570757389698163
3257681557352812938
-3747151213341814246
-8966465280115387956
7327336430450495350
8595696185560648723
-5197200702793464225
7936068733703908459
6153924391977698761
-6839713564940654454
4610596224687453206
-8091907016971478715
4730384719025183341
1039581953154104132
-1337962690305221735
-1542494247795425821
8128505679583243627
3756597728166171300
4804738921410031805
4415415525561784599
-2068265478067735255
-8365788239271014215
-5871239255891841056
6815248286057533876
3617227602782777289
-9061828969851678390
461073897687077027
-2973677681520235556
-8083178479064909945
8736568593417750581
-2296774384623513526
8517947292668395884
-1534981837265632499
-807273409165680991
-4186044945552320533
-7977896420088943791
-4035035703637267442
-3171150797683574404
4138657073201347687
465065448523711562
3487209931552756601
4928686579058965613
-5939784184924423143
-7489973769578614435
7804861921957032342
7467981654311152612
2804720921356031819
1627700927594133302
-8491251183816682310
7116875195131178045
3950343097199599450
5620442535590473483
-3484587020435445267
2977313729944642721
-809545061433796799
-8292500896134696267
198848245836228716
7637093652853037385
-8330177318910444596
-8088921220052974621
-3454045075070127268
-1980876636979981304
-6276620921915327444
5347872809635730844
7263346613600732510
-8261875436896588399
3701339131568161889
-7154752383833648999
1804583920579030544
4925534126353181729
7461900687223497572
-6962046606718337437
5531373574865393154
3359253792326581125
-7988411047591774888
3819644721564677600
5671276587666317392
-1029971585579892097
-4349610335189937101
1135013190742086467
-1744725637042107477
1125547749381005553
-744588636265106420
-5388067101870430963
-3149765934180654494
8581614941770002764
8592306961204380723
1195896392220930869
-1715880907958721415
-6149403568898773703
1132414472776926617
4059342155144310804
-7985176251840250566
4797226510592237555
7637995288174517586
-5265476641576484497
-660152330539825076
-3315241959305847628
-3382453256049823037
6136403420715230873
564572820242783793
-6850880511687131557
5572121657225835907
-8475158770269030212
-2597010810359075675
-6146340868276977273
5818382893362053755
6685544489022578691
-6175062003741472300
7814644688097156830
5675178131106424242
3571603611933812906
6571758612764814199
1602071285682694082
3594347865816291236
-6300335881941851794
4217012776222153798
4743207609281160647
-867255783834664811
-8071059233618203439
7193881469854268501
-4346530999522010552
958161591095441794
-2198834017210585710
6834107079157928311
7876300673940894569
1685127048144178754
6694271821571834609
-5935329614274008475
8038679761480862184
6718160118244358137
-3182736478163180292
-1632756942582150130
-3841500937953087637
-4291107330729431469
-833074414957851585
-23625053264343968
-2503896161629471198
-3418975465402388399
9051597753027124816
-3406580114446701705
2812493495238238719
252983656834218346
7128941744969160079
7711303308980200160
7913400407431354867
7483087310385189621
-598219288744642833
7063855203073696823
518807297849537945
-5595879090352905906
-1952321452846772720
8467862653556151381
-1913077480394809437
-5740148371925933882
-5476101493799111825
8694289821625834555
-6216930488646770123
4144904362303444936
7109155344798314039
3630144468001158950
-4175044003751472418
-1964167534274656346
-9212881193929071613
-3228384271303228006
3613386045962125096
-4422893742093299170
-6736490454993663221
-5703675413724357458
927157639555241548
-9119389643029055864
-8506521236582392808
-7517165859759106844
-5271733747232358004
-5703183951095115476
8472140268318420389
8359524589555835842
-5276739922638328515
6519476806919078477
-2086863971949478092
1255429363788893814
5277709259355426347
-8914464863762678881
-8520632749868659783
2838091149470021485
6744898938415762500
6527178798961531478
-5432793419857406993
-1134449461011864348
7702367835857715420
-4844983888056131462
-3713654557729491068
5630647833836040328
-3221108052186253383
7398631798606661688
-7256910573245396514
8308599786100622347
-5421686840411739502
318951904052750793
7526284554176419967
4926226324555892746
-282465978976186486
6797468512182240005
4039480952417102913
-4653836020042332281
7296682137888894474
418328811539378284
-7720011455952398211
-7496262653600316163
3067810456941800068
4305750675950968059
1054876766752224572
946699215012338966
6050797118662646484
3160598848269833883
2457765753528575807
-7604888719168633942
-6604751718355632709
4444538809815942711
-4575888989282246797
-8591725246688996314
-6283425693557299769
-506893134880746982
-8609111586421981129
-7192258715316889030
3444689810794944326
4136385420677230855
6977349729988642589
-8885069682816774814
4005373146530184315
-6935423857365477159
-1953157642467237515
-3862493943988412715
-4491669206292325427
-5653685018999330538
5797617924457726769
-2158546774951374352
-4379247820452209357
-8234985547322968859
-2259482849339758626
-4375644834375081381
2407908164985388095
-7074431704504128900
5926107323796891757
8200594842344508448
-303429875914004210
5861391680921034810
944960297467578380
1426144244057814596
3514313626604886295
5851127098417361943
-4638359948015624821
-5935542858156478574
8255556364363894453
-3052663234141228029
7761820454097708905
2822645753203672373
6906396683286432414
-1396906697095000000
-9207116738755198978
-6826175758878956514
-7733780507306249147
-2428977755640385826
2280739588051656760
3174540452399560541
-3423450385060590478
-2061736283751455185
-51758657721381745
2818819550873422543
-383231890572301883
-8271228722369845310
9067458034758574441
4284828052993734182
1544762873717585184
-1477834571346921172
-2084649285833052775
7768176858078358290
3231410140520846312
-4815275050173093300
-5685602503393574336
-6945469483209653697
-4081540261748731445
-1865182682318401776
-7865809443640391823
-8177829350826196308
3588426558825683351
-7276757922692328501
1063815048865447049
8722585993781275470
322011515950961818
-111444386959930591
-8690716061410596833
413439106341806001
-1578624787506041748
-7361228668063598860
-9176307901497282391
1312164508616819973
-4757324986659053904
7037298644597283282
-8276638921905327302
-3895054941927964525
-5028991260192797058
-1991783242057111803
4531492575592394249
8862969808231313935
-7483215586203553366
7449878083916369913
6943357686311161881
-8921033697231531910
-1365937918157381084
6003831336496592001
443748424298996449
2820174307247949506
-8930028685451892597
-6606499481409674037
-7808628529824183580
-6371157878623138908
-1191558361922411092
6185119154639737496
-4477989572181922377
7595559184779647650
-3174907002942471215
-4779086475169195362
-288666390873265147
-2604494515308175827
741041172583638581
-2724031079357275465
2382911985227044227
3383016985780045156
3418451812342379591
2858911571784840089
8065326060926824308
2606984352060215314
-7642403449709161291
-92860682507089288
2802807297246536023
-8404500132661066458
-6094988058243923104
-7595304912654505661
-8945613676693457638
-2645598356987416013
-825114746136838945
2943300522656247996
-6346300739520814215
2339809570377332086
-5369979592181110026
-4453988975677283684
-9144190321895213851
5284915626131431417
852657668925964952
-7653703019053330516
4517730048981926303
5397363254409200346
6529847503002197165
-1692861144730989249
4436696703857194132
7077785751173689029
-3716565219723564694
-7727523866482191789
-2277518557160807369
6618922083065447616
-4539885023607921459
8932881972353694103
88534707019739220
-372645249911808449
7951349602759061249
-2874840460379736898
-5046409709390354060
-1962878356219717823
7863420741562613788
-2611831146743123406
-6599837848209223060
4373313832006480501
6785477830855995834
7109260904701481229
-6432674419326406562
8671770789948109260
-6209906485884066381
-1298289728721376820
3395688050394648705
-5582178418720239919
5953579394093512194
6696888779902697750
-2299947672181109599
-5221193982773845879
-7485487238471669174
-2966187278753386350
-7515893735868429527
-2289743852863129386
-6754977617002317104
8055035767327224979
-258386705672313678
-9045161734922059274
-4271026173614872626
-212983527176510806
-4480048862397337587
-7070869554647836474
-99435378441769379
-2366809508980261782
3035038556984966446
9131224113041702374
-2307848549279054583
-6759553353177825959
5246457218661843199
-6040061883174458353
5252993787219186549
-6592842803508310786
3040328401474530651
4490622415459881951
-1966338279544387275
-5264509641502027935
-8509302583613116358
5947293336854386967
-8191454429180787392
9190512938628203011
-3612010574565570785
-584725475039215926
-9042319505331818906
2024918785185496622
-1918603044132414919
1462130073299421617
7358743120658680867
1149442028819396978
4635541421251975104
-4601790451622501802
4735980801943654043
-6833660726951706273
-7129272008741138808
7497132452884561764
-4046904952599809426
-7158068093440012389
4202270317152224827
-8693020145305989672
6940355838132160535
-6915348499066159040
7477964425265621109
821606580646429455
5707939385348112587
-7183504421866007218
1600231632806639649
3134999190540085909
-1542232383501596031
4069111171644921459
-6206436693745657677
-3473185444055940411
2274503685210781685
203251463786508407
-2696736445927423374
-8274522839089381384
2131451573312950491
3933715962680903331
-1702694829810068100
-3358692269505998714
-4182785338248771093
-3854199175676498768
8674249008302499974
1921090990457446246
-5603787840210684334
-4315378960086848699
8708763560325368868
1043361473087907312
197283758574659585
1587086886808885540
7283655748413496857
-4155499018100127309
-8345568006997976676
-7623698017321962840
5497802635036879185
-5769304345757607597
-7044206989263083569
1883376476350161480
-1296893385346514597
2253846628644635942
3284260092574278990
-9008925037793886842
-8368395784867923046
2284379093365280181
-3276544275225902971
5607854572232625967
-8424110050280813309
-7484786128448001888
6885406542446231991
-5281817566948863661
8642394293468828144
-518697508631425659
-8767951075485440550
-2454705495458529924
-2034168062596988170
-2825316495796585570
5907221298687398924
8793023054666221242
-8818294023490369214
7253987629229636499
-8402615280886071963
8317207117905033099
8862426237057348309
-1818608831920242374
7792886053889220161
395119817510087182
-159483088220219835
2749323491628044459
-8754995617056317074
6455482856502656063
-5125145036909317713
-2053435107881296665
-5389453858436958168
-4247291014640570922
3820922726386715360
8755559346786539225
-2059083978137705082
9094462885938385286
-6118242661945663443
-8691303727714013806
4828857202132424980
2417376459854712213
-1046296830523760923
76251316322796397
5395292281504366735
1200263233485735432
-6998290057807710917
-4291493300288812940
8965027945689978971
-5535923551616745326
6038661761506862294
-1251238547469584119
-6034172062640988486
3009772007719204112
2036843942643102910
-2379261820462209275
6706204399096967608
4929368500838767949
-3553102336811813291
-7713914559325493608
-2841676129656881967
2271656070098079690
1037023387911431229
7347858809625731174
447397644319813678
-165795973545465285
7520467742563767493
-8210095891948580913
-6032657214426631468
-4115748438709160582
-8503907262844320611
-3239287231047622718
-1315223959315847746
7932776971796693414
4812219843382485857
-7301680710575105489
463750704786845608
-6857749722158756463
3368482620480350745
-3283270692786298820
1257663557362813056
4826295158480970984
4647413168079516052
4376966258071255609
-5773269986924675698
-5378699121209676383
-6440461292041887516
2382426917414671257
-3941819252743792375
2063575091370043114
-3754053668725070591
5156370773381774555
-3291559261920410222
-7377977482151854926
-8151293691584183256
-7283993654004755131
-4192326172667715237
180604055055169479
-3296456675883953898
3502510845760007338
7010924276002572467
-8809065195096599018
947642205940549167
-5385537249890202479
-6932528057568867609
7065221060437823699
5905055941872077172
-4678726459447663357
-8735763339754712849
5203073629384068409
-3652432494449008463
-7823160150035726894
794249579378543643
-4620747219322851425
6504465711645201248
-2270819689943837066
3763285734883690035
-6686716088012864449
3610084801689226312
-6981148859720148373
2865051795429918701
5732944515355059947
-3333307402327293632
766832051768165842
5942580068307165204
3833854281930673428
123077587949959463
2348439063888615756
-6691599696714076992
3787020472867489510
4634825204717668542
5634706203962667503
4414099537132285176
4941167822436894045
-608973789957727561
8556653203196579720
-1379124819653208034
-6941072618461313849
-7963789764073362950
-7273415486317713764
1050656117889645239
7594028509049751156
-6315309392483863834
6291442923225351554
5010906275996572633
-3900318848301728120
-8963554618409314978
6018641953300645757
1797701934329285597
-7790543634407640064
-7956765969654512096
2241488058004423468
-276421274438901622
1729853366387155808
3036926867604684520
-2048928297371666315
8939220707786185310
-1272799350744810580
8977315052041277515
2707519855514695474
8732843514650058678
2325532988800688306
-6595993041154510107
461436028263880214
3251367506358243575
-6282754433984310142
763866869706749928
-985918886318729368
1740126037981585888
-3708317668645277943
-3603500707650257526
-4488464012437086531
-8486098563596716567
-5685149382072526764
-5516931871002486896
-3710154354006596575
2396085611150343002
-5257727564138704831
1619650717341926052
5195052674759712046
-57167024322842107
1246453218617842851
-7300216881186850753
-4248035397448942774
-2901486774679816593
4627183237363916621
3490469538808305901
-641296879189318453
-8091634157538766119
5254885710391138776
-5289642852158128373
-1541526768635629880
2834103079369928763
-8057515460092391911
-4595742089571904833
8600390633617640920
4393756319132924838
-8690124345701380826
7866576113340895115
-3061873284528456248
-5295045465633304607
-2549689272203498237
-6719522112518617217
-7100390008334527804
-5483703385391965908
4913250882493481369
-4317515119936650885
501174938575526146
-8109793286902118151
1239585011552693824
4483304456267238355
8824437633825893435
-2081265111210072467
-6317533119990651087
2615425226049888969
-6818308023500369068
464098448481254928
4126348383745483901
-2140361463758283053
3158986214629900032
6762330993624022175
8325178746224233621
7727115678845931341
-8240210429963382718
-940415022552647187
-202658488388760612
-5297443792466905800
1840848880823843395
-1247043476329724186
8193534055954643057
8708752360243767625
948223640148622714
9038362052565301884
8852526557827312102
810067918938531886
-4977997420793944836
5166899464429738864
-8956015930535800390
2420025939860659200
7637660878558952620
-2244015987817045493
7612369293897193240
6598132981359524758
-548176348047239669
5613061346723845145
-7603044093174944268
-268886646698338239
5955061777414214628
-7057974542385626232
7592036674792056069
-6877210863258588192
4136380367039673024
-8873311207356144485
-6152189531591576162
8046021685069769060
-4847411431971122436
-2171184283895460175
-2749566582179357212
-6596826271593118393
1358721120864681533
6076152359408392737
2190609939333204140
6932639971019692365
-8071006555424837523
2666165647163340944
-8300353881995851996
-3381299024709108173
6904717554955151340
397242931505564187
4620290839673975123
7924497970773019201
-8360291425523348325
-6395945633142271042
-266893549648994617
-7503593820279639580
-5041846259853346443
-96415308824933540
5947021459447809684
-2400257488542407727
682625880884350440
-2512346814961359892
8500993396239092897
4489563673511019043
-7160549933950402575
-1097982440009765819
-1057952542303625894
-4376405455210705328
-1159514227928535208
-1945278234078776687
5713014937920165769
886720308663584531
-1751271042943524239
-7710528027833427554
6689024254240076864
8352857959906729837
-6637171571708691638
-1862396277886347795
-5715009224102355943
827957941427433969
2729111190626408579
1516199613903032963
-4976168389897510937
-7492106985145719459
5401140137601462297
4956126618474609139
-5638240947256623536
4957801366570676979
-6392418462462658998
7461966230605672098
-4396474713128893708
-277167144631131335
3797085517647336536
-8936615423548208677
7395901697861074527
5948340753284292141
-7936478422771207620
-2819800414696664771
-3627158374105338201
-4171145772160186792
2353969577414666795
-1805719959600766714
-805614959043765769
8923423159850053928
-8707554510573683939
6756871902441838709
-5247895193618942845
-1510321897564962820
-7032762215239632923
-2473845757256782581
-2288652390863265229
2460528390051567153
6569012000551779051
8802446458100491067
-4209647626717354471
-625653602673789324
-2600289688622465762
-889305800681925481
-2373633737287737773
-205887421398457440
5636960665828891411
7460701391128569030
-2711304591685155515
-7965124443634034243
-8592873429166825073
2034901556203965439
-3167668871180030042
-965420152559594547
-5113954673580054853
-3835759376917652833
-2825319746094646426
8816271700543135410
-526142875017934439
-6708234822310526870
-1304753272343710201
4385853633333586686
5653231896805341062
863356787255652960
-4470468211371525147
-1893973624410841323
-7082273763951028651
1945786109636206690
6726696617713153281
1454068188007247787
4160758010753708150
8958330808961387452
-3134435460809863982
2184408420667115619
7237300102721734709
-1957590033086240723
3250728804941389085
8532503536113702039
4960651917266580984
5246141644644299038
6757776550201397844
-8388675223914479274
1812995334969284166
5166023152376080980
-7361625848712741016
7006422955498725720
8293646724873095388
-1201071336132923959
-1843921060214341675
-5487281968920391812
-4749298169084869151
1958042590336440825
-6522242102892532323
4170007516780842790
-253382038868549836
-5243683122430849003
5706344191507825718
3865463466240567990
-5461355180342040702
8295464382327368710
-5924179035578229915
377872747222364124
4464289448417062777
-2385947124746715908
-1256788148331186620
-7505564508903239248
130333997183751313
7937392720817863936
1830804034504888946
-1386735796399192077
-3886495748707495361
5126229382986482646
7878086133896463164
-2957727033863241782
2605430974769704433
9213605013227137867
3523968668931516473
9066598418877635793
813840053768678454
5973691847519381699
-4510220896859961775
7933427407380960960
-4091858151482669277
-2631505835963473775
-5517401116436959009
5081547367786156934
-2113178690855415018
8690965822342756180
5860709468180973459
8064131816828727404
4047468682330031577
3972493657017129406
-4677755972317734407
3166881464375738634
-2410784981474048482
-8974466804582129986
5202151316393223580
7261047446949365330
6158500871224119394
-1282613433387309359
1410196403110961308
-2755271738371556635
1821708782890605889
-272391079030611182
8504432231932962955
-2863351392293563325
-5833678375673307423
738845194850773558
-8470472211415525463
7413344850500955337
3804601920633030746
1757481363245650831
-1689319711084901730
-2689200710357900655
2757362362486649844
-3689337711138901728
4195795391451929480
4351331710881888756
3195914392210930723
701949295768128821
1498101358485403935
6718676536613592056
8313816860478517392
-4200589112729926854
1373190831171479026
-8955755936847898358
-9190214082467470004
2358602120077680332
6195781391249929126
-937436842931607517
3369244421450766217
-67242350353941334
-2630097082058343181
1867700512809885443
594354776006627907
2415173524227782861
-7501152358833888406
-6758942141122113907
1026888672378692933
-634630012192348800
7347583870493810379
4686386086139247217
4931893522763265934
1595537184985648316
-146867728338383595
4051456752430124035
4229259523827570399
-1835741376927652987
6387087975193770559
-7388085101860430821
-6409557685183119664
2056976393823539020
-2317497119690650259
-6071124048045151919
-1293257957773648492
6133764690084410026
7621209948544072707
-2384929018605582143
6022205592682717526
2919247920214845195
8570540777066461619
-7358589937244777363
-7270992690764838239
4615229981949418360
6362359524660190859
-6254806834008898035
2816249700493135244
3184436881335535852
-7506384235581390893
-982546890824575042
-4864988131354548295
3471965724367244818
-3760933726347836551
-9189723362012067754
-6840647354657799328
-4178747664009041637
-2484450019658444218
-490310687477662812
-3779205475924196401
-5364712160899856113
-7261194805221226386
-6583250835532759869
-9079470749530129591
1127459907694805235
-3908552006934667015
-3247029476127723832
9059610977317352399
4619805718368927775
-5091735158287767326
1185488181830527625
4738849194894773882
5502528845814007324
-6579494630017862290
-4161232106162110292
8413855607660856960
-129145008166137909
9068963265682720586
-1296438675909954008
-138889680107600025
-1604866719326634456
-1811468762119777118
-2185840155926169542
-2208197439532367343
-2324450162924245773
-2890682584037275637
-3151738353564633688
-3312802382740140173
-3357905707959173812
-3593286523786250302
-4341766724811689661
-4496395654369317320
-4799035831110725204
-5599700847208221405
-5932102625385609989
-601365943784756897
-6162947324507053330
-6237225386243356575
-6365086022926708021
-6409133277725009790
-6666640731218555667
-6974448804336129376
-7244570757266327934
-7402734281641073196
-7717307706597034768
-8543134814286327823
-8604769718409632655
-8851453106026851602
-922729887773674204
1978209065824574247
2515257722796787281
2600368633583640730
390427073704203351
4507987928147477649
5082138874375887068
5730521719802184390
5821744782934605757
5933701962734903797
6213925354582969315
6579813155637084319
7600253632840639847
7734445005828304333
7739171563081867691
7911910053664227396
8417849371287704224
8614798793761585963
8769048100855794356
9030484820615456959
9198481215327194426
